package ru.mirea.task21.exercise1;


import java.util.List;

public class MetroList {

    private final List<String> metro = List.of(
            "Авиамоторная",
            "Автозаводская",
            "Академическая",
            "Алексеевская",
            "Алма-Атинская",
            "Алтуфьево",
            "Андроновка",
            "Аннино",
            "Арбатская",
            "Арбатская",
            "Аэропорт",
            "Бабушкинская",
            "Багратионовская",
            "Балтийская",
            "Баррикадная",
            "Бауманская",
            "Беговая",
            "Белокаменная",
            "Белорусская",
            "Беляево",
            "Бибирево",
            "Библиотека им. Ленина",
            "Битцевский парк",
            "Борисово",
            "Боровицкая",
            "Ботанический сад",
            "Братиславская",
            "Бульвар Адмирала Ушакова",
            "Бульвар Дмитрия Донского",
            "Бульвар Рокоссовского",
            "Юго-Западная"
    );

    public void printList(boolean odd) {
        for (int i = odd ? 0 : 1; i < metro.size(); i += 2) {
            System.out.println(metro.get(i));
        }
    }

}
